Astbel/HKSP_PIC24FJ128GL305/HKS_PIC24FJ128GL305.X/src/pmbus_stack.c
/********************************************************************
 * FileName:        PMBus_stack.c
 * Dependencies:    See INCLUDES section below
 * Processor:       dsPIC33F
 * Compiler:        C30 v3.11
 * Company:         Microchip Technology, Inc.
 *
 * SOFTWARE LICENSE AGREEMENT:
 * Microchip Technology Incorporated ("Microchip") retains all ownership and
 * intellectual property rights in the code accompanying this message and in all
 * derivatives hereto.  You may use this code, and any derivatives created by
 * any person or entity by or on your behalf, exclusively with Microchip's
 * proprietary products.  Your acceptance and/or use of this code constitutes
 * agreement to the terms and conditions of this notice.
 *
 * CODE ACCOMPANYING THIS MESSAGE IS SUPPLIED BY MICROCHIP "AS IS".  NO
 * WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE APPLY TO THIS CODE, ITS INTERACTION WITH MICROCHIP'S
 * PRODUCTS, COMBINATION WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.
 *
 * YOU ACKNOWLEDGE AND AGREE THAT, IN NO EVENT, SHALL MICROCHIP BE LIABLE, WHETHER
 * IN CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE OR BREACH OF STATUTORY DUTY),
 * STRICT LIABILITY, INDEMNITY, CONTRIBUTION, OR OTHERWISE, FOR ANY INDIRECT, SPECIAL,
 * PUNITIVE, EXEMPLARY, INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, FOR COST OR EXPENSE OF
 * ANY KIND WHATSOEVER RELATED TO THE CODE, HOWSOEVER CAUSED, EVEN IF MICROCHIP HAS BEEN
 * ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWABLE BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO
 * THIS CODE, SHALL NOT EXCEED THE PRICE YOU PAID DIRECTLY TO MICROCHIP SPECIFICALLY TO
 * HAVE THIS CODE DEVELOPED.
 *
 * You agree that you are solely responsible for testing the code and
 * determining its suitability.  Microchip has no obligation to modify, test,
 * certify, or support the code.
 *********************************************************************
 *
 * File Description: This file contains the i2c handler used for implementing
 *               	the pmbus stack
 *
 ********************************************************************/

#include <xc.h>
#include "../mcc_generated_files/i2c1.h"
#include "../inc/Gernirc_Type.h"
#include "../inc/commands.h"
#include "../inc/Myvalue.h"
#include "../inc/pmbus_stack.h"

/************************************************/
/*                   變數區                     */
/************************************************/
uint8_t counter_MWD;
uint8_t counter_MRD;
uint8_t byteCRC;
uint8_t codeCMD;
uint8_t dumpI2CBUF;
uint8_t matrixIndex;
uint8_t protocolCMD;
uint8_t byteNr;
/************************************************/
/*                   結構體                    */
/************************************************/
Flag global_flags = {0, 0, 0};
PMBUS_connect i2c_flags = {0, 0};
Pmbus_Martrix_Index Pmbus_1_3_Index;
UpdateParams Pmbus_Updata;
/************************************************/
/*                   PTR                        */
/************************************************/
Flag *PTR_global_flags;
PMBUS_connect *PTR_i2c_flags;
/************************************************/
/*                  Buffer                      */
/************************************************/

uint8_t buffer[MAX_BYTES + 1];
/************************************************
*   Pmbus_Array 1.3 Version CMD Buffer SIZE    
*   
*   Buffer only delcare Read/Write
*
************************************************/
/*10~1F*/
unsigned char PAGE[1];
unsigned char OPERATION[1];
unsigned char ON_OFF_CONFIG[1];
unsigned char PHASE[1];
unsigned char PAGE_PLUS_READ[2]; 
unsigned char ZONE_CONFIG[2]; 
unsigned char ZONE_ACTIVE[2];
unsigned char WRITE_PROTECT[1];
unsigned char CAPABILITY[1]; 
unsigned char QUERY[2];
unsigned char SMBALERT_MASK[2];

/*20~2F*/
unsigned char VOUT_MODE[1];
unsigned char VOUNT_COMMAND[2];
unsigned char VOUT_TRIM[2];
unsigned char VOUT_CAL_OFFSET[2];
unsigned char VOUT_MAX[2];
unsigned char VOUT_MARGIN_HIGH[1];
unsigned char VOUT_MARGIN_LOW[1];
unsigned char VOUT_TRANSITION_RATE[1];
unsigned char VOUT_DROOP[2];
unsigned char VOUT_SCALE_LOOP[2];
unsigned char VOUT_SCALE_MONITOR[2];
unsigned char VOUT_MIN[2];
/*30~3F*/
unsigned char COEFICIENTS[5];
unsigned char POUT_MAX[2];
unsigned char MAX_DUTY[2];
unsigned char FREQUENCY_SWITCH[2];
unsigned char POWER_MODE[1];
unsigned char VIN_ON[2];
unsigned char VIN_OFF[2];
unsigned char INTERLEAVE[2];
unsigned char IOUT_CAL_GAIN[2];
unsigned char IOUT_CAL_OFFSET[2];
unsigned char FAN_CONFIG_1_2[1];
unsigned char FAN_COMMAND_1[2];
unsigned char FAN_COMMAND_2[2];
unsigned char FAN_CONFIG_3_4[1];
unsigned char FAN_COMMAND_3[2];
unsigned char FAN_COMMAND_4[2];

/*40~4F 4D&4E unused */
unsigned char VOUT_OV_FAULT_LIMIT[2];
unsigned char VOUT_OV_FAULT_RESPONSE[1];
unsigned char VOUT_OV_WARN_LIMIT[2];
unsigned char VOUT_UV_WARN_LIMIT[2];
unsigned char VOUT_UV_FAULT_LIMIT[2];
unsigned char VOUT_UV_FAULT_RESPONSE[1];
unsigned char IOUT_OC_FAULT_LIMIT[2];
unsigned char IOUT_OC_FAULT_RESPONSE[1];
unsigned char IOUT_OC_LV_FAULT_LIMIT[2];
unsigned char IOUT_OC_LV_FAULT_RESPONSE[1];
unsigned char IOUT_OC_WARN_LIMIT[2];
unsigned char IOUT_UC_FAULT_LIMIT[2];
unsigned char IOUT_UC_FAULT_RESPONSE[1];
unsigned char OT_FAULT_LIMIT[2];

/*50~5F*/
unsigned char OT_FAULT_RESPONSE[1];
unsigned char OT_WARN_LIMIT[2];
unsigned char UT_WARN_LIMIT[2];
unsigned char UT_FAULT_LIMIT[2];
unsigned char UT_FAULT_RESPONSE[1];
unsigned char VIN_OV_FAULT_LIMIT[2];
unsigned char VIN_OV_FAULT_RESPONSE[1];
unsigned char VIN_OV_WARN_LIMIT[2];
unsigned char VIN_UV_WARN_LIMIT[2];
unsigned char VIN_UV_FAULT_LIMIT[2];
unsigned char VIN_UV_FAULT_RESPONSE[1];
unsigned char IIN_OC_FAULT_LIMIT[2];
unsigned char IIN_OC_FAULT_RESPONSE[1];
unsigned char IIN_OC_WARN_LIMIT[2];
unsigned char POWER_GOOD_ON[2];
unsigned char POWER_GOOD_OFF[2];

/*60~6B,6C~6F Reserved*/
unsigned char TON_DELAY[2];
unsigned char TON_RISE[2];
unsigned char TON_MAX_FAULT_LIMIT[2];
unsigned char TON_MAX_FAULT_RESPONSE[1];
unsigned char TOFF_DELAY[2];
unsigned char TOFF_FALL[2];
unsigned char TOFF_MAX_WARN_LIMIT[2];
unsigned char POUT_OP_FAULT_LIMIT[2];
unsigned char POUT_OP_FAULT_RESPONSE[1];
unsigned char POUT_OP_WARN_LIMIT[2];
unsigned char PIN_OP_WARN_LIMIT[2];

/*78~7F,70~77Reserved*/
unsigned char STATUS_BYTE[1];
unsigned char STATUS_WORD[2];
unsigned char STATUS_VOUT[1];
unsigned char STATUS_IOUT[1];
unsigned char STATUS_INPUT[1];
unsigned char STATUS_TEMPERATURE[1];
unsigned char STATUS_CML[1];
unsigned char STATUS_OTHER[1];

/*80~8F*/
unsigned char STATUS_MFR_SPECIFIC[1];
unsigned char STATUS_FANS_1_2[1];
unsigned char STATUS_FANS_3_4[1];
unsigned char READ_KWH_IN[4];
unsigned char READ_KWH_OUT[4];
unsigned char READ_KWH_CONFIG[2];
unsigned char READ_EIN[5];
unsigned char READ_EOUT[5];
unsigned char READ_VIN[2];
unsigned char READ_IIN[2];
unsigned char READ_VCAP[2];
unsigned char READ_VOUT[2];
unsigned char READ_IOUT[2];
unsigned char READ_TEMP1[2];
unsigned char READ_TEMP2[2];
unsigned char READ_TEMP3[2];

