Astbel/HKSP_PIC24FJ128GL305/HKS_PIC24FJ128GL305.X/src/pmbus_stack.c
/*90~9F*/
unsigned char READ_FAN_SPEED_1[2];
unsigned char READ_FAN_SPEED_2[2];
unsigned char READ_FAN_SPEED_3[2];
unsigned char READ_FAN_SPEED_4[2];
unsigned char READ_DUTY_CYCLE[2];
unsigned char READ_FREQUENCY[2];
unsigned char READ_POUT[2];
unsigned char READ_PIN[2];
unsigned char PMBUS_REVISION[1];
unsigned char MFR_ID[1];
unsigned char MFR_MODEL[8];
unsigned char MFR_REVISION[1];
unsigned char MFR_LOCATION[1];
unsigned char MFR_DATE[1];
unsigned char MFR_SERIAL[1];
unsigned char APP_PROFILE_SUPPORT[2];

/*A0~AE,AF Reserved*/
unsigned char MFR_VIN_MIN[2];
unsigned char MFR_VIN_MAX[2];
unsigned char MFR_IIN_MAX[2];
unsigned char MFR_PIN_MAX[2];
unsigned char MFR_VOUT_MIN[2];
unsigned char MFR_VOUT_MAX[2];
unsigned char MFR_IOUT_MAX[2];
unsigned char MFR_POUT_MAX[2];
unsigned char MFR_TAMBIENT_MAX[2];
unsigned char MFR_TAMBIENT_MIN[2];
unsigned char MFR_EFFICIENCY_LL[14];
unsigned char MFR_EFFICIENCY_HL[14];
unsigned char MFR_PIN_ACCURACY[1];
unsigned char IC_DEVICE_ID[2];
unsigned char IC_DEVICE_REV[2];

/*B0~BF*/
unsigned char USER_DATA_00[1];
unsigned char USER_DATA_01[1];
unsigned char USER_DATA_02[1];
unsigned char USER_DATA_03[1];
unsigned char USER_DATA_04[1];
unsigned char USER_DATA_05[1];
unsigned char USER_DATA_06[1];
unsigned char USER_DATA_07[1];
unsigned char USER_DATA_08[1];
unsigned char USER_DATA_09[2];
unsigned char USER_DATA_10[2];
unsigned char USER_DATA_11[2];
unsigned char USER_DATA_12[2];
unsigned char USER_DATA_13[2];
unsigned char USER_DATA_14[2];
unsigned char USER_DATA_15[2];

/*C0~C2*/
unsigned char MFR_MAX_TEMP_1[2];
unsigned char MFR_MAX_TEMP_2[2];
unsigned char MFR_MAX_TEMP_3[2];

typedef struct
{

    char protocol;
    char nr_bytes;
    unsigned char *ptrCommandData;

} command;

command matrix[NR_COMMANDS] = 
{

    /*10~1F*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {RW_BYTE,   0x1, PAGE},         // 0x0 	PAGE 
    {RW_BYTE,   0x1, OPERATION},    // 0x1 	OPERATION
    {RW_BYTE,   0x1, ON_OFF_CONFIG},
    {SEND_BYTE, 0x0, 0x0},          //CLEAR_FAULTS
    {RW_BYTE,   0x1, PHASE},
    {RW_BYTE,   0x1, WRITE_PROTECT},// 0x10 WRITE_POTECT 
    {SEND_BYTE, 0x0, 0x0},          //STORE_DEFAULT_ALL
    {SEND_BYTE, 0x0, 0x0},          //RESTORE_DEFAULT_ALL
     /*20~2F*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {RW_BYTE, 0x1, VOUT_MODE},
    {RW_WORD, 0x2, VOUNT_COMMAND},
    {RW_BYTE, 0x2, VOUT_MAX},
    {RW_BYTE, 0x1, VOUT_MARGIN_HIGH},
    {RW_BYTE, 0x1, VOUT_MARGIN_LOW},
    {RW_BYTE, 0x1, VOUT_TRANSITION_RATE},
    {RW_BYTE, 0x2, VOUT_DROOP},
    {RW_BYTE, 0x2, VOUT_SCALE_LOOP},
    {RW_BYTE, 0x2, VOUT_SCALE_MONITOR},
    {RW_BYTE, 0x2, VOUT_MIN},
 
     /*30~3F*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {RW_BYTE, 0x2, POUT_MAX},
    {RW_BYTE, 0x2, MAX_DUTY},
    {RW_BYTE, 0x2, FREQUENCY_SWITCH},
    {RW_BYTE, 0x1, POWER_MODE},
    {RW_BYTE, 0x2, VIN_ON},
    {RW_BYTE, 0x2, VIN_OFF},
    {RW_BYTE, 0x2, IOUT_CAL_GAIN},
    {RW_BYTE, 0x2, IOUT_CAL_OFFSET},
    {RW_BYTE, 0x1, FAN_CONFIG_1_2},
    {RW_BYTE, 0x2, FAN_COMMAND_1},
    {RW_BYTE, 0x2, FAN_COMMAND_2},
    {RW_BYTE, 0x1, FAN_CONFIG_3_4},
    {RW_BYTE, 0x2, FAN_COMMAND_3},
    {RW_BYTE, 0x2, FAN_COMMAND_4},
 
    /*40~4F*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {RW_BYTE, 0x2, VOUT_OV_FAULT_LIMIT},
    {RW_BYTE, 0x1, VOUT_OV_FAULT_RESPONSE},
    {RW_BYTE, 0x2, VOUT_OV_WARN_LIMIT},
    {RW_BYTE, 0x2, VOUT_UV_WARN_LIMIT},
    {RW_BYTE, 0x2, VOUT_UV_FAULT_LIMIT},
    {RW_BYTE, 0x1, VOUT_UV_FAULT_RESPONSE},
    {RW_BYTE, 0x2, IOUT_OC_FAULT_LIMIT},
    {RW_BYTE, 0x1, IOUT_OC_FAULT_RESPONSE},
    {RW_BYTE, 0x2, IOUT_OC_LV_FAULT_LIMIT},
    {RW_BYTE, 0x1, IOUT_OC_LV_FAULT_RESPONSE},
    {RW_BYTE, 0x2, IOUT_OC_WARN_LIMIT},
    {RW_BYTE, 0x2, IOUT_UC_FAULT_LIMIT},
    {RW_BYTE, 0x1, IOUT_UC_FAULT_RESPONSE},
    {RW_BYTE, 0x2, OT_FAULT_LIMIT},

    /*50~5F*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {RW_BYTE, 0x1, OT_FAULT_RESPONSE},
    {RW_BYTE, 0x2, OT_WARN_LIMIT},
    {RW_BYTE, 0x2, UT_WARN_LIMIT},
    {RW_BYTE, 0x2, UT_FAULT_LIMIT},
    {RW_BYTE, 0x1, UT_FAULT_RESPONSE},
    {RW_BYTE, 0x2, VIN_OV_FAULT_LIMIT},
    {RW_BYTE, 0x1, VIN_OV_FAULT_RESPONSE},
    {RW_BYTE, 0x2, VIN_OV_WARN_LIMIT},
    {RW_BYTE, 0x2, VIN_UV_WARN_LIMIT},
    {RW_BYTE, 0x2, VIN_UV_FAULT_LIMIT},
    {RW_BYTE, 0x1, VIN_UV_FAULT_RESPONSE},
    {RW_BYTE, 0x2, IIN_OC_FAULT_LIMIT},
    {RW_BYTE, 0x1, IOUT_UC_FAULT_RESPONSE},
    {RW_BYTE, 0x2, IIN_OC_WARN_LIMIT},
    {RW_BYTE, 0x2, POWER_GOOD_ON},
    {RW_BYTE, 0x2, POWER_GOOD_OFF},

    /*60~6F*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {RW_BYTE, 0x2, TON_DELAY},
    {RW_BYTE, 0x2, TON_RISE},
    {RW_BYTE, 0x2, TON_MAX_FAULT_LIMIT},
    {RW_BYTE, 0x1, TON_MAX_FAULT_RESPONSE},
    {RW_BYTE, 0x2, TOFF_DELAY},
    {RW_BYTE, 0x2, TOFF_FALL},
    {RW_BYTE, 0x2, TOFF_MAX_WARN_LIMIT},
    {RW_BYTE, 0x2, POUT_OP_FAULT_LIMIT},
    {RW_BYTE, 0x1, POUT_OP_FAULT_RESPONSE},
    {RW_BYTE, 0x2, POUT_OP_WARN_LIMIT},
    {RW_BYTE, 0x2, PIN_OP_WARN_LIMIT},


    /*70~7F*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {RW_BYTE, 0x2, STATUS_WORD},
    {RW_BYTE, 0x1, STATUS_VOUT},
    {RW_BYTE, 0x1, STATUS_IOUT},
    {RW_BYTE, 0x1, STATUS_INPUT},
    {RW_BYTE, 0x1, STATUS_TEMPERATURE},
    {RW_BYTE, 0x1, STATUS_CML},
    {RW_BYTE, 0x1, STATUS_OTHER},


    /*80~8F*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {READ_BYTE, 0x1, STATUS_MFR_SPECIFIC},
    {READ_BYTE, 0x1, STATUS_FANS_1_2},
    {READ_BYTE, 0x1, STATUS_FANS_3_4},
    {READ_BYTE, 0x4, READ_KWH_IN},
    {READ_BYTE, 0x4, READ_KWH_OUT},
    {READ_WORD, 0x2, READ_KWH_CONFIG},
    {RW_BLOCK,  0x5, READ_EIN},
    {RW_BLOCK,  0x5, READ_EOUT},
    {READ_WORD, 0x2, READ_VIN},
    {READ_WORD, 0x2, READ_IIN},
    {READ_WORD, 0x2, READ_VCAP},
    {READ_WORD, 0x2, READ_VOUT},
    {READ_WORD, 0x2, READ_IOUT},
    {READ_WORD, 0x2, READ_TEMP1},
    {READ_WORD, 0x2, READ_TEMP2},
    {READ_WORD, 0x2, READ_TEMP3},

