Astbel/HKSP_PIC24FJ128GL305/HKS_PIC24FJ128GL305.X/src/pmbus_stack.c
    /*90~9F*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {READ_WORD, 0x2, READ_FAN_SPEED_1},
    {READ_WORD, 0x2, READ_FAN_SPEED_2},
    {READ_WORD, 0x2, READ_FAN_SPEED_3},
    {READ_WORD, 0x2, READ_FAN_SPEED_4},
    {READ_WORD, 0x2, READ_DUTY_CYCLE},
    {READ_WORD, 0x2, READ_FREQUENCY},
    {READ_WORD, 0x2, READ_POUT},
    {READ_WORD, 0x2, READ_PIN},
    {RW_BYTE,   0x1, PMBUS_REVISION},
    {BW_BR_PROC_CALL, 0x1, MFR_ID},
    {BW_BR_PROC_CALL, 0x8, MFR_MODEL},
    {BW_BR_PROC_CALL, 0x1, MFR_REVISION},
    {BW_BR_PROC_CALL, 0x1, MFR_LOCATION},
    {BW_BR_PROC_CALL, 0x1, MFR_DATE},
    {BW_BR_PROC_CALL, 0x1, MFR_SERIAL},
    {BW_BR_PROC_CALL, 0x2, APP_PROFILE_SUPPORT},

    /*A0~AF*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {READ_WORD, 0x2, MFR_VIN_MIN},
    {READ_WORD, 0x2, MFR_VIN_MAX},
    {READ_WORD, 0x2, MFR_IIN_MAX},
    {READ_WORD, 0x2, MFR_PIN_MAX},
    {READ_WORD, 0x2, MFR_VOUT_MIN},
    {READ_WORD, 0x2, MFR_VOUT_MAX},
    {READ_WORD, 0x2, MFR_IOUT_MAX},
    {READ_WORD, 0x2, MFR_POUT_MAX},
    {READ_WORD, 0x2, MFR_TAMBIENT_MAX},
   
    {RW_BLOCK,  0xe, MFR_EFFICIENCY_LL},
    {RW_BLOCK,  0xe, MFR_EFFICIENCY_HL},
    {READ_BYTE, 0x1, MFR_PIN_ACCURACY},
    {RW_BLOCK,  0x2, IC_DEVICE_ID},
    {RW_BLOCK,  0x2, IC_DEVICE_REV},

    
    /*B0~BF Block Write*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {RW_BLOCK, 0x1, USER_DATA_00},
    {RW_BLOCK, 0x1, USER_DATA_01},
    {RW_BLOCK, 0x1, USER_DATA_02},
    {RW_BLOCK, 0x1, USER_DATA_03},
    {RW_BLOCK, 0x1, USER_DATA_04},
    {RW_BLOCK, 0x1, USER_DATA_05},
    {RW_BLOCK, 0x1, USER_DATA_06},
    {RW_BLOCK, 0x1, USER_DATA_07},
    {RW_BLOCK, 0x1, USER_DATA_08},
    {RW_BLOCK, 0x1, USER_DATA_09},
    {RW_BLOCK, 0x1, USER_DATA_10},
    {RW_BLOCK, 0x1, USER_DATA_11},
    {RW_BLOCK, 0x1, USER_DATA_12},
    {RW_BLOCK, 0x1, USER_DATA_13},
    {RW_BLOCK, 0x1, USER_DATA_14},
    {RW_BLOCK, 0x1, USER_DATA_15},

    
     /*C0~C1*/
    /* Protocol----------Nr_bytes-------Command_ram_index--*/
    {RW_WORD, 0x2, MFR_MAX_TEMP_1},
    {RW_WORD, 0x2, MFR_MAX_TEMP_2},
    {RW_WORD, 0x2, MFR_MAX_TEMP_3},
};

/********************************************************************
 * Definition of the CMDtoMatrix array. Each command can be found
 * here at an index equal with its command code. Here it is re-defined with another
 * index for the command matrix array.
 * For example command CLEAR_FAULTS has command code 0x3. In this
 * array, at index 0x3, can be found the index of the structure
 * associated with CLEAR_FAULTS in the big array. This index is 0x2.
 *******************************************************************/
const unsigned char CMDtoMatrix[MATRIX_NUMS] =
{
    0,                    // 0x0 	PAGE 
    1,                    // 0x1 	OPERATION
    2,                    // 0x2 	ON_OFF_CONFIG
    3,                    // 0x3 	CLEAR_FAULTS
    4,                    // 0x4 	PHASE code
    UNSUPPORTED_CMD_CODE, // 0x5 	PAGE_PLUS_WRITE
    UNSUPPORTED_CMD_CODE, // 0x6 	PAGE_PLUS_READ
    UNSUPPORTED_CMD_CODE, // 0x7 	ZONE_CONFIG
    UNSUPPORTED_CMD_CODE, // 0x8 	ZONE_ACTIVE
    UNSUPPORTED_CMD_CODE, // 0x9 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xa 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xb 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xc 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf 	cmd code
    5,                    // 0x10 	WRITE_POTECT 
    6,                    // 0x11 	STORE_DEFAULT_ALL 
    7,                    // 0x12 	RESTORE_DEFAULT_ALL 
    UNSUPPORTED_CMD_CODE, // 0x13 	STORE_DEFAULT_CODE
    UNSUPPORTED_CMD_CODE, // 0x14 	RESTORE_DEFAULT_CODE
    UNSUPPORTED_CMD_CODE, // 0x15 	STORE_USER_ALL
    UNSUPPORTED_CMD_CODE, // 0x16 	RESTORE_USER_ALL
    UNSUPPORTED_CMD_CODE, // 0x17 	STORE_USER_CODE
    UNSUPPORTED_CMD_CODE, // 0x18 	RESTORE_USER_CODE
    UNSUPPORTED_CMD_CODE, // 0x19   CAPABILITY
    UNSUPPORTED_CMD_CODE, // 0x1a 	QUERY_COMMAND
    UNSUPPORTED_CMD_CODE, // 0x1b 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x1c 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x1d 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x1e 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x1f 	cmd code
    8,                    // 0x20 	VOUT_MODE
    9,                    // 0x21 	VOUT code
    UNSUPPORTED_CMD_CODE, // 0x22 	VOUT_TRIM
    UNSUPPORTED_CMD_CODE, // 0x23 	VOUT_CAL_OFFSET
    10,                   // 0x24 	VOUT_MAX
    11,                   // 0x25 	VOUT_MARGIN_HIGH
    12,                   // 0x26 	VOUT_MARGIN_LOW
    13,                   // 0x27 	VOUT_TRANSITION_RATE
    14,                   // 0x28 	VOUT_DROOP
    15,                   // 0x29 	VOUT_SCALE_LOOP
    16,                   // 0x2a 	VOUT_SCALE_MONITOR
    17,                   // 0x2b 	VOUT_MIN
    UNSUPPORTED_CMD_CODE, // 0x2c 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x2d 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x2e 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x2f 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x30 	COEFICIENTS
    18,                   // 0x31 	POUT_MAX
    19,                   // 0x32 	MAX_DUTY
    20,                   // 0x33 	FREQUENCY_SWITCH
    21,                   // 0x34 	POWER_MODE
    22,                   // 0x35 	VIN_ON 
    23,                   // 0x36 	VIN_OFF 
    UNSUPPORTED_CMD_CODE, // 0x37 	INTERLEAVE
    24,                   // 0x38 	IOUT_CAL_GAIN
    25,                   // 0x39 	IOUT_CAL_OFFSET
    26,                   // 0x3a 	FAN_CONFIG_1_2
    27,                   // 0x3b 	FAN_COMMAND_1
    28,                   // 0x3c 	FAN_COMMAND_2
    29,                   // 0x3d 	FAN_CONFIG_3_4
    30,                   // 0x3e 	FAN_COMMAND_3
    31,                   // 0x3f 	FAN_COMMAND_4
    32,                   // 0x40 	VOUT_OV_FAULT_LIMIT 
    33,                   // 0x41 	VOUT_OV_FAULT_RESPONSE
    34,                   // 0x42 	VOUT_OV_WARN_LIMIT
    35,                   // 0x43 	VOUT_UV_WARN_LIMIT
    36,                   // 0x44 	VOUT_UV_FAULT_LIMIT
    37,                   // 0x45 	VOUT_UV_FAULT_RESPONSE
    38,                   // 0x46 	IOUT_OC_FAULT_LIMIT
    39,                   // 0x47 	IOUT_OC_FAULT_RESPONSE
    40,                   // 0x48 	IOUT_OC_LV_FAULT_LIMIT
    41,                   // 0x49 	IOUT_OC_LV_FAULT_RESPONSE
    42,                   // 0x4a 	IOUT_OC_WARN_LIMIT
    43,                   // 0x4b 	IOUT_UC_FAULT_LIMIT 
    44,                   // 0x4c 	IOUT_UC_FAULT_RESPONSE
    UNSUPPORTED_CMD_CODE, // 0x4d 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x4e 	cmd code
    45,                   // 0x4f 	OT_FAULT_LIMIT
    46,                   // 0x50 	OT_FAULT_RESPONSE
    47,                   // 0x51 	OT_WARN_LIMIT
    48,                   // 0x52 	UT_WARN_LIMIT
    49,                   // 0x53 	UT_FAULT_LIMIT
    50,                   // 0x54 	UT_FAULT_RESPONSE
    51,                   // 0x55 	VIN_OV_FAULT_LIMIT
    52,                   // 0x56 	VIN_OV_FAULT_RESPONSE
    53,                   // 0x57 	VIN_OV_WARN_LIMIT
    54,                   // 0x58 	VIN_UV_WARN_LIMIT
    55,                   // 0x59 	VIN_UV_FAULT_LIMIT
    56,                   // 0x5a 	VIN_UV_FAULT_RESPONSE
    57,                   // 0x5b 	IIN_OC_FAULT_LIMIT
    58,                   // 0x5c 	IIN_OC_FAULT_RESPONSE
    59,                   // 0x5d 	IIN_OC_WARN_LIMIT
    60,                   // 0x5e 	POWER_GOOD_ON
    61,                   // 0x5f 	POWER_GOOD_OFF
    62,                   // 0x60 	TON_DELAY
    63,                   // 0x61 	TON_RISE
    64,                   // 0x62 	TON_MAX_FAULT_LIMIT
    65,                   // 0x63 	TON_MAX_FAULT_RESPONSE
    66,                   // 0x64 	TOFF_DELAY
    67,                   // 0x65 	TOFF_FALL
    68,                   // 0x66 	TOFF_MAX_WARN_LIMIT
    UNSUPPORTED_CMD_CODE, // 0x67 	cmd code
    69,                   // 0x68 	POUT_OP_FAULT_LIMIT
    70,                   // 0x69 	POUT_OP_FAULT_RESPONSE
    71,                   // 0x6a 	POUT_OP_WARN_LIMIT
    72,                   // 0x6b 	PIN_OP_WARN_LIMIT
    UNSUPPORTED_CMD_CODE, // 0x6c 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x6d 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x6e 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x6f 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x70 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x71 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x72 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x73 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x74 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x75 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x76 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x77 	cmd code
    UNSUPPORTED_CMD_CODE, // 0x78 	cmd code
    73,                   // 0x79	STATUS_WORD_COMMAND
    74,                   // 0x7a	STATUS_VOUT_COMMAND
    75,                   // 0x7b	STATUS_IOUT_COMMAND
    76,                   // 0x7c	STATUS_INPUT_COMMAND
    77,                   // 0x7d	STATUS_TEMP_COMMAND
    78,                   // 0x7e	STATUS_CML_COMMAND
    79,                   // 0x7f	STATUS_OTHER_COMMAND
    80,                   // 0x80 	STATUS_MFR_SPECIFIC
    81,                   // 0x81	STATUS_FAN_1_2_COMMAND
    82,                   // 0x82	STATUS_FAN_3_4_COMMAND
    83,                   // 0x83 	READ_KWH_IN 
    84,                   // 0x84 	READ_KWH_OUT
    85,                   // 0x85 	READ_KWH_CONFIG
    86,                   // 0x86 	READ_EIN
    87,                   // 0x87 	READ_EOUT
    88,                   // 0x88	READ_VIN_COMMAND
    89,                   // 0x89	READ_IIN_COMMAND
    90,                   // 0x8a 	READ_VCAP_COMMAND
    91,                   // 0x8b	READ_VOUT_COMMAND
    92,                   // 0x8c	READ_IOUT_COMMAND
    93,                   // 0x8d	READ_TEMP1_COMMAND
    94,                   // 0x8e	READ_TEMP2_COMMAND
    95,                   // 0x8f 	READ_TEMP3_COMMAND
    96,                   // 0x90	READ_FAN_SPEED_1_COMMAND
    97,                   // 0x91	READ_FAN_SPEED_2_COMMAND
    98,                   // 0x92 	READ_FAN_SPEED_3_COMMAND
    99,                   // 0x93 	READ_FAN_SPEED_4_COMMAND
    100,                  // 0x94 	READ_DUTY_CYCLE
    101,                  // 0x95 	READ_FREQUENCY
    102,                  // 0x96	READ_POUT_COMMAND
    103,                  // 0x97	READ_PIN_COMMAND
    104,                  // 0x98 	PMBUS_REVISION
    105,                  // 0x99 	MFR_ID 
    106,                  // 0x9a 	MFR_MODEL
    107,                  // 0x9b 	MFR_REVISION
    108,                  // 0x9c 	MFR_LOCATION
    109,                  // 0x9d 	MFR_DATE
    110,                  // 0x9e 	MFR_SERIAL
    111,                  // 0x9f 	APP_PROFILE_SUPPORT
    112,                  // 0xa0	MFR_VIN_MIN
    113,                  // 0xa1	MFR_VIN_MAX
    114,                  // 0xa2	MFR_IIN_MAX
    115,                  // 0xa3	MFR_PIN_MAX
    116,                  // 0xa4	MFR_VOUT_MIN
    117,                  // 0xa5	MFR_VOUT_MAX
    118,                  // 0xa6	MFR_IOUT_MAX
    119,                  // 0xa7	MFR_POUT_MAX
    120,                  // 0xa8	MFR_TAMBIENT_MAX
    UNSUPPORTED_CMD_CODE, // 0xa9 	cmd code
    121,                  // 0xaa 	MFR_EFFICIENCY_LL
    122,                  // 0xab	MFR_EFFICIENCY_HL
    123,                  // 0xac 	MFR_PIN_ACCURACY 
    124,                  // 0xad 	IC_DEVICE_ID 
    125,                  // 0xae 	IC_DEVICE_REV
    UNSUPPORTED_CMD_CODE, // 0xaf 	cmd code
    126,                  // 0xb0 	USER_DATA_00
    127,                  // 0xb1 	USER_DATA_01
    128,                  // 0xb2 	USER_DATA_02
    129,                  // 0xb3 	USER_DATA_03
    130,                  // 0xb4 	USER_DATA_04
    131,                  // 0xb5 	USER_DATA_05
    132,                  // 0xb6 	USER_DATA_06
    133,                  // 0xb7 	USER_DATA_07
    134,                  // 0xb8 	USER_DATA_08
    135,                  // 0xb9 	USER_DATA_09
    136,                  // 0xbA 	USER_DATA_10
    137,                  // 0xbB 	USER_DATA_11
    138,                  // 0xbC 	USER_DATA_12
    139,                  // 0xbD 	USER_DATA_13
    140,                  // 0xbE 	USER_DATA_14
    141,                  // 0xbF 	USER_DATA_15
    142,                  // 0xc0 	MFR_MAX_TEMP_1 
    143,                  // 0xc1 	MFR_MAX_TEMP_2 
    144,                  // 0xc2 	MFR_MAX_TEMP_3 
    UNSUPPORTED_CMD_CODE, // 0xc3 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xc4 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xc5 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xc6 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xc7 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xc8 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xc9 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xcA 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xcB 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xcC 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xcD 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xcE 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xcF 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd0 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd1 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd2 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd3 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd4 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd5 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd6 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd7 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd8 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xd9 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xdA 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xdB 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xdC 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xdD 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xdE 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xdF 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe0 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe1 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe2 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe3 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe4 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe5 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe6 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe7 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe8 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xe9 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xeA 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xeB 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xeC 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xeD 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xeE 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xeF 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf0 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf1 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf2 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf3 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf4 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf5 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf6 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf7 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf8 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xf9 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xfA 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xfB 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xfC 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xfD 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xfE 	cmd code
    UNSUPPORTED_CMD_CODE, // 0xfF 	cmd code

