Astbel/HKSP_PIC24FJ128GL305/HKS_PIC24FJ128GL305.X/src/pmbus_stack.c
};
/********************************************************************
 * Function:          ClearCommandData
 *
 * PreCondition:      None
 *
 * Input:             None
 *
 * Output:            None
 *
 * Side Effects:    	 None
 *
 * Overview:          Function that can be called from the main application
 *					 to clear the RAM locations for each command
 *
 * Note:              None
 *******************************************************************/
void ClearCommandData(void)
{

    unsigned char i, j;

    for (i = 0; i < NR_COMMANDS; i++)
    {

        for (j = 0; j < matrix[i].nr_bytes; j++)
        {
            *((matrix[i].ptrCommandData) + j) = 0;
        }
    }
}

/********************************************************************
 * Function:         TransmissionContentFaultHandler
 *
 * PreCondition:     None
 *
 * Input:            Token to determine the fault nature.
 *
 * Output:           None
 *
 * Side Effects:     None
 *
 * Overview:         This function modifies stack flags
 *               	and STATUS registers as an action to a present
 *               	data transmission or data content fault.
 *
 * Note:             Cannot be called by main application
 *
 *
 *******************************************************************/

void TransmissionContentFaultHandler(char token)
{
    global_flags.comm_errors = 1;
    global_flags.ready_to_copy = 0;

    switch (token)
    {
    case 1:
        STATUS_WORD[0] |= 0x2; /* Corrupted data(Pec byte error) */
        STATUS_CML[0] |= 0x20;
        break;
    case 2:
        STATUS_WORD[0] |= 0x2; /* Not all bytes received or host reads to many bytes*/
        STATUS_CML[0] |= 0x2;  /* OR Improper address bit in the address byte */
        break;
    case 3:
        STATUS_WORD[0] |= 0x2; /* Host sends too many bytes */
        STATUS_CML[0] |= 0x40;
        break;
    case 4:
        STATUS_WORD[0] |= 0x80; /* Device busy */
        break;
    case 5:
        STATUS_WORD[0] |= 0x2; /* Unsupported commmand code */
        STATUS_CML[0] |= 0x80;
        global_flags.unsupported_command = 1;
        break;
    }
}

/********************************************************************
 * Function:        CopyBufferInRam
 *
 * PreCondition:    A successful PMBUS write transaction took place.
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Following a PMBus command being received in a write
 *                  PMBus transaction, this function copies the content
 *                  of the temp BUFFER in the appropriate RAM locations
 *                  of the command
 *
 * Note:            None
 *******************************************************************/

void CopyBufferInRam(void)
{
    unsigned char temp_nr;
    unsigned char i = 0, buffer_offset = 1;

    temp_nr = buffer[0];

    if ((protocolCMD == RW_BLOCK) || (protocolCMD == BW_BR_PROC_CALL))
    {
        buffer_offset = 2; /* First data byte is at buffer[2] */
        --temp_nr;         /* Decrement by one since first byte recieved was the # of bytes to be sent*/

        if (temp_nr != buffer[1])
        {
            TransmissionContentFaultHandler(2);
            return;
        }
    }

    for (i = 0; i < temp_nr; i++)
    {
        *((matrix[matrixIndex].ptrCommandData) + i) = buffer[i + buffer_offset];
    }
}

/********************************************************************
 * Function:        WriteData
 *
 * PreCondition:    The PMBus slave is in a position which requires it
 *                  to put data on the bus.
 *
 * Input:           Data to be put on the bus
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function receives data as a parameter and fills
 *                  the I2CTRN register. At the end it disables the clock stretching
 *                  mechanism.
 *
 * Note:            None
 *******************************************************************/

void WriteData(unsigned char data)
{
    I2C1TRN = data;          /* Data to be transmitted*/
                             //   I2C1CONbits.SCLREL = 1;	/*  33F series Release SCL Clock */
    I2C1CONLbits.SCLREL = 1; /* Release SCL Clock */
}

/********************************************************************
 * Function:        BasicCrc
 *
 * PreCondition:    None
 *
 * Input:           The parameters are the result of the previous
 *                  calculation and the next byte to be added
 *
 * Output:          Result of byteCRC8 calculus
 *
 * Side Effects:    None
 *
 * Overview:        Basic byteCRC8 calculus
 *
 * Note:            None
 *******************************************************************/

unsigned char BasicCrc(unsigned char remainder, unsigned char byte)
{
    char i = 0;

    remainder ^= byte;
    for (i = 8; i > 0; --i)
    {
        if (remainder & 0x80)
        {
            remainder = (remainder << 1) ^ 0x7;
        }
        else
        {
            remainder = (remainder << 1);
        }
    }
    return remainder;
}

/********************************************************************
 * Function:        HostWritesCommandByte
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Function that verifies the validity of the first
 *                  byte received, which is the command code.
 *
 * Note:
 *******************************************************************/

void HostWritesCommandByte(void)
{
    codeCMD = dumpI2CBUF; /* Store off the command code */

    matrixIndex = CMDtoMatrix[dumpI2CBUF];

    if (matrixIndex == UNSUPPORTED_CMD_CODE) /* Verify command code is supported  */
    {
        TransmissionContentFaultHandler(5);
    }
    else
    {
        protocolCMD = matrix[matrixIndex].protocol; /* Determine protocol */
        i2c_flags.flag_rw = 1;
        byteCRC = BasicCrc(byteCRC, dumpI2CBUF);
    }
}

/********************************************************************
 * Function:        HostWritesNextBytes
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Function to process the remaining bytes received
 *                  by the slave.
 *
 * Note:            None
 *******************************************************************/
void HostWritesNextBytes(void)
{
    char extra_bytes = 1; /* If extra byte is received then need to check CRC */

    ++buffer[0]; /* Increment buffer[0] since data byte received */

