Astbel/HKSP_PIC24FJ128GL305/HKS_PIC24FJ128GL305.X/src/pmbus_stack.c
    if (protocolCMD == RW_BLOCK)
    {
        extra_bytes = 2; /* Need to add 2 extra bytes: # of bytes to be sent and CRC byte*/
    }

    if ((buffer[0] == matrix[matrixIndex].nr_bytes + extra_bytes) && (protocolCMD != BW_BR_PROC_CALL))
    {
        if (dumpI2CBUF != byteCRC)
        {
            TransmissionContentFaultHandler(1); /* Wrong pec byte */
        }

        --buffer[0]; /* Remove CRC from Buffer[0] count */
    }

    else
    {
        i2c_flags.wr_prot = 1;
        byteCRC = BasicCrc(byteCRC, dumpI2CBUF);
        buffer[counter_MWD] = dumpI2CBUF;
    }
}

/********************************************************************
 * Function:        HostReadsAddr
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Function that is processed after the slave
 *                  has ACKed its address following a read
 *                  address by the host.
 *
 * Note:            None
 *******************************************************************/
void HostReadsAddr()
{

    byteNr = matrix[matrixIndex].nr_bytes;
    byteCRC = BasicCrc(byteCRC, dumpI2CBUF);

    switch (protocolCMD)
    {
    case BW_BR_PROC_CALL:

        CopyBufferInRam();
        // byteNr = Example_APP_func(codeCMD);   /* App function call Returns # of bytes to be read*/

    case RW_BLOCK:

        byteCRC = BasicCrc(byteCRC, byteNr);
        dumpI2CBUF = byteNr;

        break;

        /* Covers READ_BYTE, RW_BYTE, READ_WORD, and RW_WORD */
    case RW_BYTE:
    case RW_WORD:

        counter_MRD = 1;
        dumpI2CBUF = *(matrix[matrixIndex].ptrCommandData);
        byteCRC = BasicCrc(byteCRC, dumpI2CBUF);

        break;

    case SEND_BYTE: /* Not supported protocols */

        global_flags.comm_errors = 1;
        dumpI2CBUF = 0xFF;

        break;
    }

    WriteData(dumpI2CBUF);
}
/********************************************************************
 * Function:        HostReadsData
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        As the host keeps ACKing bytes sent by the slave,
 *                  this function takes valid data and puts it on the
 *                  bus, checking at the same time for the validity
 *                  of the host's request for more data bytes
 *
 * Note:            None
 *******************************************************************/

void HostReadsData()
{
    if (counter_MRD < byteNr)
    {
        dumpI2CBUF = *((matrix[matrixIndex].ptrCommandData) + counter_MRD);
        byteCRC = BasicCrc(byteCRC, dumpI2CBUF);
        WriteData(dumpI2CBUF);
    }

    else if (counter_MRD == byteNr)
    {
        WriteData(byteCRC);
    }

    else
    {
        TransmissionContentFaultHandler(2);
        WriteData(0xFF);
    }
}

/********************************************************************
 * Function:        I2CSlaveHandler
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Function called from the main application as a source
 *                  of interrupt from the I2C (SI2CIF flag) module has been
 *                  detected. This function achieves the functionality of
 *                  the I2C slave 7bit address
 *
 * Note:           slaver 控制器
 *******************************************************************/

void I2CSlaveHandler(void)
{
    char mask = 0x26;
    char token = 0;

    token = I2C1STAT & mask;
    dumpI2CBUF = I2C1RCV;

    switch (token)
    {
    case MasterWritesAddress: /* MASTER WRITES ADDRESS STATE */
                              /* 寫入地址校驗 */
        byteCRC = BasicCrc(0, dumpI2CBUF);
        buffer[0] = 0;
        /* 旗標清理 */
        global_flags.ready_to_copy = 0;
        global_flags.comm_errors = 0;
        global_flags.unsupported_command = 0;

        i2c_flags.wr_prot = 0;
        i2c_flags.flag_rw = 0;

        protocolCMD = 0;
        byteNr = 0;
        counter_MRD = 0;
        counter_MWD = 0;

        T1CONbits.TON = 1; /* Timer used to determine when a stop bit is detected */

        break;

    case MasterWritesData: /* MASTER WRITES DATA STATE */

        if (global_flags.comm_errors == 0)
        {
            if (counter_MWD == 0)
            {
                HostWritesCommandByte(); /*I2C CMD READ/WRITE*/
            }

            else
            {
                HostWritesNextBytes();
            }

            counter_MWD++;
        }

        break;

    case MasterReadsAddress: /* MASTER READS ADDRESS STATE */

        if ((i2c_flags.flag_rw == 1) && (global_flags.comm_errors == 0))
        {
            HostReadsAddr(); /* Address write ACKed and codeCMD received */
        }
        else
        {
            TransmissionContentFaultHandler(2); /* Improper address bit in the address byte */
            WriteData(0xFF);                    /* 錯誤代碼 &  clear memory block */
        }
        break;

    case MasterReadsData: /* MASTER READS DATA STATE */

        if (global_flags.comm_errors == 0)
        {
            HostReadsData();
            ++counter_MRD; /* Increment read counter */
        }

        else
        {
            WriteData(0xFF);
        }

        break;
    }
    I2C1CONLbits.SCLREL = 1; /* Release SCL Clock */
}
/********************************************************************
 * Function:        Clear_faults
 *
 * PreCondition:    Appropriate action generated by the host(e.g. CLEAR_FAULTS
 *                  command received)
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is supplied to the application as a mean to clear
 *                  the STATUS registers following the appropriate action generated
 *                  by the host.
 *
 * Note:            Must be placed in an application file
 *******************************************************************/
void Clear_faults(void)
{
    STATUS_WORD[0] = 0;
    STATUS_WORD[1] = 0;
    STATUS_VOUT[0] = 0;
    STATUS_IOUT[0] = 0;
    STATUS_INPUT[0] = 0;
    STATUS_TEMPERATURE[0] = 0;
    STATUS_CML[0] = 0;
    STATUS_OTHER[0] = 0;
    STATUS_FANS_1_2[0] = 0;
    STATUS_FANS_3_4[0] = 0;
}
/********************************************************************
 * Function:        初始化 struct class
 *
 *
 * Note:
 *******************************************************************/
void Init_Struct_Fun(void)
{
    /*Variable*/
    counter_MWD = 0;
    counter_MRD = 0;
    byteCRC = 0;
    codeCMD = 0;
    dumpI2CBUF = 0;
    matrixIndex = 0;
    protocolCMD = 0;
    byteNr = 0;

