Astbel/HKSP_PIC24FJ128GL305/HKS_PIC24FJ128GL305.X/src/pmbus_stack.c
    /* struct */
    PTR_global_flags=&global_flags;
    PTR_i2c_flags=&i2c_flags;
}
/********************************************************************
 *
 * PreCondition:    Linear11     5bit 2's complement 
 *
 * Input:           number      : User Data
 *                  exponent    : Resloution Select  
 * 
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:       
 *
 * Note:          
 *******************************************************************/
uint16_t linear11(uint16_t real_data,uint8_t exponent)
{
    static uint16_t mantissa = 0;  
    
    // Adjust Real_data as needed to calculate mantissa.
    mantissa = real_data << exponent;

    // Ensure the mantissa fits within 11 bits.
    mantissa &= 0x07FF;

    // Handle exponent as 2's complement in 5 bits.
    exponent = (0-exponent) & 0x1F;

    // Combine exponent and mantissa.
    return (mantissa | (exponent << 11));
}
/********************************************************************
 *
 * PreCondition:    Linear16
 *
 * Input:           real_data   
 *                  exponent    
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:       
 *
 * Note:          12Vdc only
 *******************************************************************/
uint16_t linear16(uint16_t real_data, uint8_t exponent)
{
    static uint16_t linear16_Data = 0;
	/* real value multipi a gain  */
    linear16_Data = real_data << exponent;

	return linear16_Data;
}

/********************************************************************
 *
 * PreCondition:    Update_Martix_Buffer_Data
 *
 * Input:           data            User data needs write into buffer
 *                  buffer          Store in the ADDR
 *                  matrixIndex     index of Buffer
 * 
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:       select linear11 / 16 to convert pmbus formant
 *
 * Note:          
 *******************************************************************/
void Update_Martix_Buffer_Data(uint16_t data,uint8_t *buffer,FormatType Linear_select,int8 exponent,Pmbus_Martrix_Index Pmbus_1_3_Index)
{
    static uint16_t convert_data=0;
    if (Linear_select==LINEAR11)
    {
      convert_data = linear11(data,exponent);
    }
    else if (Linear_select==LINEAR16)
    {
      convert_data = linear16(data,exponent);
    }
    
    //ptr  func  linear 11/16
    // convert_data= adc_to_slinear11(data,12);
    // 低位字節
    buffer[1] = (convert_data >> 8) & 0xFF;
    // 高位字節
    buffer[0] = convert_data & 0xFF;

    matrix[Pmbus_1_3_Index].ptrCommandData = buffer;
}
/********************************************************************
 *
 * PreCondition:    Pmbus_Data_Updata
 *
 * Input:          
 * 
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:      routine jobs for updatapmbus buffer
 *
 * Note:          
 *******************************************************************/
void Pmbus_Data_Updata(void)
{
     
    UpdateParams update_params[] = 
    {
        {115, READ_VOUT,        LINEAR16, VDC_ARR_EXPONENT,     READ_VOUT_COMMAND_0x8B},
        {115, READ_VIN,         LINEAR11, VAC_ARR_EXPONENT,     READ_VIN_COMMAND_0x88},
        {115, READ_TEMP1,       LINEAR11, TEMP_EXPONENT,        READ_TEMP1_COMMAND_0x8D},
        {115, READ_TEMP2,       LINEAR11, TEMP_EXPONENT,        READ_TEMP2_COMMAND_0x8E},
        {115, READ_TEMP3,       LINEAR11, TEMP_EXPONENT,        READ_TEMP3_COMMAND_0x8F},
        {115, READ_POUT,        LINEAR11, POUT_ARR_EXPONENT,    READ_POUT_COMMAND_0x96},
        {115, READ_PIN,         LINEAR11, PIN_ARR_EXPONENT,     READ_PIN_COMMAND_0x97},
        {115, READ_FAN_SPEED_1, LINEAR11, FAN_RPM_EXPONENT,     READ_FAN_SPEED_1_COMMAND_0x90},

        // 繼續添加新的CMD...
    };

    // 遍歷數組 Update_Martix_Buffer_Data
    for (int i = 0; i < sizeof(update_params) / sizeof(UpdateParams); i++)
    {
        Update_Martix_Buffer_Data
        (
            update_params[i].data,
            update_params[i].buffer,
            update_params[i].linear_select,
            update_params[i].exponent,
            update_params[i].pmbus_index
        );
    }
}

